{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "33af7e3f",
   "metadata": {},
   "source": [
    "# num 17"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7864b6e2",
   "metadata": {},
   "source": [
    "##### № 28762 Досрочная волна 2026"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "dd24c0c0",
   "metadata": {},
   "source": [
    "В файле содержится последовательность натуральных чисел. Её элементы могут принимать целые значения от 1 до 100 000 включительно. Определите количество пар элементов последовательности, в которых хотя бы одно число кратно минимальному элементу последовательности, кратному 23. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c14ce189",
   "metadata": {},
   "outputs": [],
   "source": [
    "a = [int(x) for x in open(\"tasks/17_28762.txt\").readlines()]\n",
    "min_a = min([x for x in a if x % 23 == 0])\n",
    "summs = []\n",
    "cnt = 0\n",
    "\n",
    "for i in range(len(a) - 1):\n",
    "    if a[i] % min_a == 0 or a[i + 1] % min_a == 0:\n",
    "        cnt += 1\n",
    "        summs.append(a[i] + a[i + 1])\n",
    " \n",
    "print(cnt, max(summs))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "39f4fecb",
   "metadata": {},
   "source": [
    "Ответ: 113 168437"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1e262e99",
   "metadata": {},
   "source": [
    "##### № 27629 Апробация 04.03.26"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "58632ada",
   "metadata": {},
   "source": [
    "В файле содержится последовательность целых чисел. Её элементы могут принимать целые значения от -100 000 до 100 000 включительно. Определите количество пар последовательности, в которых хотя бы один из элементов является четырёхзначным числом, а квадрат суммы элементов пары меньше квадрата максимального из четырёхзначных элементов последовательности, оканчивающихся на 43. В ответе запишите количество найденных пар чисел, затем максимальный из квадратов сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "abebd860",
   "metadata": {},
   "outputs": [],
   "source": [
    "def lens(x):\n",
    "    return len(str(abs(x)))\n",
    "\n",
    "\n",
    "a = [int(x) for x in open(\"tasks/17_27629.txt\").readlines()]\n",
    "max_a = max([x for x in a if lens(x) == 4 and str(x)[-2:] == \"43\"])\n",
    "kvs = []\n",
    "cnt = 0\n",
    "\n",
    "for i in range(len(a) - 1):\n",
    "    kv_s = (a[i] + a[i + 1]) ** 2\n",
    "    if (lens(a[i]) == 4 or lens(a[i + 1]) == 4) and kv_s < max_a ** 2:\n",
    "        cnt += 1\n",
    "        kvs.append(kv_s)\n",
    "\n",
    "print(cnt, max(kvs))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "27bc1417",
   "metadata": {},
   "source": [
    "Ответ: 1218 98843364"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "07650eb7",
   "metadata": {},
   "source": [
    "##### № 27301 "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "13ccbd82",
   "metadata": {},
   "source": [
    "В файле содержится последовательность целых чисел. Её элементы могут принимать целые значения от –100 000 до 100 000 включительно. Определите количество троек элементов последовательности, в которых ровно одно число является отрицательным, а сумма элементов тройки не меньше максимального элемента последовательности, начинающегося на 45. В ответе запишите количество найденных троек, затем минимальную из тех сумм элементов таких троек, которые заканчиваются на 45. В данной задаче под тройкой подразумеваются три идущих подряд элемента последовательности."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2dea00e7",
   "metadata": {},
   "outputs": [],
   "source": [
    "def find_negat(a1, a2, a3):\n",
    "    cnt = 0\n",
    "    for a in [a1, a2, a3]:\n",
    "        if a < 0:\n",
    "            cnt += 1\n",
    "    if cnt == 1:\n",
    "        return True \n",
    "    else:\n",
    "        return False\n",
    "\n",
    "pos = [int(x) for x in open(\"tasks/17_27301.txt\").readlines()]\n",
    "max_a = max([x for x in pos if str(abs(x))[:2] == \"45\"])\n",
    "cnt = 0\n",
    "summs = []\n",
    "\n",
    "for i in range(0, len(pos) - 2):\n",
    "    a, b, c = pos[i], pos[i + 1], pos[i + 2]\n",
    "    sumel = a + b + c\n",
    "    if find_negat(a, b, c) and sumel >= max_a:\n",
    "        cnt += 1\n",
    "        if str(sumel)[-2:] == \"45\":\n",
    "            summs.append(sumel)\n",
    "\n",
    "print(cnt, min(summs))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2f976956",
   "metadata": {},
   "source": [
    "Ответ: 1588 49345"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
