{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "3ba2fce6",
   "metadata": {},
   "source": [
    "# num 5\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d3cfd25c",
   "metadata": {},
   "source": [
    "##### № 27617 Апробация 04.03.26"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d328e061",
   "metadata": {},
   "source": [
    "На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.\n",
    "1. Строится двоичная запись числа N.\n",
    "2. Далее эта запись обрабатывается по следующему правилу:\n",
    "a) если число чётное, то к двоичной записи числа слева дописывается 10;\n",
    "б) если число нечётное, то к двоичной записи числа слева дописывается 1 и справа дописывается 01.\n",
    "Полученная таким образом запись является двоичной записью искомого числа R.\n",
    "3. Результат переводится в десятичную систему и выводится на экран.\n",
    "4. Укажите минимальное число R, которое может быть результатом работы данного алгоритма, при условии, что N больше, чем 18. В ответе запишите это число в десятичной системе счисления."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e054e991",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "84\n"
     ]
    }
   ],
   "source": [
    "r_min:float = float(\"inf\")\n",
    "for n in range(19, 100):\n",
    "    bin_n = bin(n)[2:]\n",
    "    r = \"\"\n",
    "    if n % 2 == 0:\n",
    "        r:str = \"10\" + bin_n\n",
    "    elif n % 2 != 0:\n",
    "        r:str = \"1\" + bin_n + \"01\"\n",
    "    int_r = int(r, 2)\n",
    "    if int_r < r_min:\n",
    "        r_min = int_r\n",
    "print(r_min)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "03272127",
   "metadata": {},
   "source": [
    "Ответ: 84\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8e711804",
   "metadata": {},
   "source": [
    "##### № 27617 Апробация 04.03.26 "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "144f9c19",
   "metadata": {},
   "source": [
    "На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.\n",
    "1. Строится двоичная запись числа N.\n",
    "2. Далее эта запись обрабатывается по следующему правилу:\n",
    "a) если число N делится на 3, то к этой записи дописываются три последние двоичные цифры;\n",
    "б) если число N на 3 не делится, то остаток от деления умножается на 3, переводится в двоичную запись и дописывается в конец числа.\n",
    "Полученная таким образом запись является двоичной записью искомого числа R.\n",
    "3. Результат переводится в десятичную систему и выводится на экран.\n",
    "4. Укажите максимальное число N, после обработки которого с помощью этого алгоритма получается число R, ближайшее к 130."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d3200329",
   "metadata": {},
   "source": [
    "Fedor's solve:\n",
    "```python\n",
    "target = 130\n",
    "\n",
    "\n",
    "def calculate_r(n: int) -> int:\n",
    "    binary_n = bin(n)[2:]\n",
    "    if (rest := n % 3) == 0:\n",
    "        binary_n += binary_n[-3:]\n",
    "    else:\n",
    "        binary_n += bin(rest * 3)[2:]\n",
    "    \n",
    "    return int(binary_n, base=2)\n",
    "\n",
    "\n",
    "mapping = {n: calculate_r(n) for n in range(target)}\n",
    "\n",
    "max_n = 0\n",
    "nearest_r = float(\"inf\")\n",
    "for n, r in mapping.items():\n",
    "    now_distance = abs(target - nearest_r)\n",
    "    new_distance = abs(target - r)\n",
    "    if now_distance > new_distance:\n",
    "        nearest_r = r\n",
    "        max_n = n\n",
    "    elif now_distance == new_distance:\n",
    "        max_n = max(max_n, n)\n",
    "\n",
    "\n",
    "print(f\"Result: {max_n}\")\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b3c704ce",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "31\n"
     ]
    }
   ],
   "source": [
    "n_max = 0\n",
    "for n in range(1, 1000):\n",
    "    r_min = 1\n",
    "    r_max = 10000\n",
    "    bin_n = bin(n)[2:]\n",
    "    ost = n % 3\n",
    "    if ost == 0:\n",
    "        r = bin_n + bin_n[-3:]\n",
    "    else:\n",
    "        ost = bin(ost * 3)[2:]\n",
    "        r = bin_n + ost\n",
    "    r = int(r, 2)\n",
    "    if r >= 130:\n",
    "        if r_max - 130 >= r - 130 and 130 - r_min >= r_max - 130:\n",
    "            r_max = r\n",
    "            if n > n_max:\n",
    "                n_max = n\n",
    "    else:\n",
    "        if 130 - r_min >= 130 - r and 130 - r_min < r_max - 130:\n",
    "            r_min = r\n",
    "            if n > n_max:\n",
    "                n_max = n\n",
    "print(n_max)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "680b7a35",
   "metadata": {},
   "source": [
    "Ответ: 31"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
