{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "72846c12",
   "metadata": {},
   "source": [
    "# num 8 \n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "305e1582",
   "metadata": {},
   "source": [
    "##### № 27763 Апробация 04.03.26 (Уровень: Базовый)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "34fd42bf",
   "metadata": {},
   "source": [
    "Определите, сколько пятизначных чисел, записанных в семеричной системе счисления, содержат ровно одну цифру 0 и не более двух цифр 1."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4bb8cf18",
   "metadata": {},
   "outputs": [],
   "source": [
    "from itertools import product\n",
    "\n",
    "cnt = 0\n",
    "string = \"0123456\"\n",
    "for numb in product(string, repeat=5):\n",
    "    if numb.count(\"0\") == 1 and numb.count(\"1\") <= 2 and numb[0] != \"0\":\n",
    "        cnt += 1\n",
    "print(cnt)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5b0a8a74",
   "metadata": {},
   "source": [
    "Ответ: 5100"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b8dcf7a7",
   "metadata": {},
   "source": [
    "##### № 27620 Апробация 04.03.26"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3b50f843",
   "metadata": {},
   "source": [
    "Все пятибуквенные слова, в составе которых могут быть только русские буквы Ц, И, Т, Р, У, С, записаны в алфавитном порядке и пронумерованы.Под каким номером в списке идёт последнее слово, которое содержит ровно две буквы И и не содержит букв Ц, стоящих рядом?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "91337e03",
   "metadata": {},
   "outputs": [],
   "source": [
    "from itertools import product\n",
    "\n",
    "cnt = 0\n",
    "string = \"ИРСТУЦ\"\n",
    "for word in product(sorted(string), repeat=5):\n",
    "    word = \"\".join(word)\n",
    "    cnt += 1\n",
    "    if \"ЦЦ\" not in word and word.count(\"И\") == 2:\n",
    "        print(cnt, word)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d5e0f977",
   "metadata": {},
   "source": [
    "Ответ: 7525"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "028f62af",
   "metadata": {},
   "source": [
    "##### № 27283 "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a8e4c25f",
   "metadata": {},
   "source": [
    "Все 5-буквенные слова, составленные из букв слова ПОЛЕНИЦА, записаны в алфавитном порядке и пронумерованы. Под каким номером в списке стоит первое слово с нечётным номером, которое не начинается и не заканчивается буквой А и при этом содержит не менее трёх букв Л?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d1997328",
   "metadata": {},
   "outputs": [],
   "source": [
    "from itertools import product\n",
    "\n",
    "cnt = 0\n",
    "string = sorted(\"ПОЛЕНИЦА\")\n",
    "for word in product(string, repeat=5):\n",
    "    word = \"\".join(word)\n",
    "    cnt += 1\n",
    "    if word[0] != \"А\" and word[-1] != \"А\" and word.count(\"Л\") >= 3 and cnt % 2 != 0:\n",
    "        print(cnt)\n",
    "        break"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "20c1ba63",
   "metadata": {},
   "source": [
    "Ответ: 5851"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
