{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "4ef0181e",
   "metadata": {},
   "source": [
    "# num 9"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "57a999ca",
   "metadata": {},
   "source": [
    "##### From Rodya 1\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1d6a9174",
   "metadata": {},
   "outputs": [],
   "source": [
    "strings = [i.split() for i in open(\"9rodya1.txt\").readlines()]\n",
    "cnt = 0\n",
    "\n",
    "for string in strings:\n",
    "    string = [int(i) for i in string]\n",
    "    povt = [i for i in string if string.count(i) == 2]\n",
    "    nepovt = [i for i in string if string.count(i) == 1]\n",
    "    if len(povt) == 4:\n",
    "        arpovt = sum(povt) / 4\n",
    "        arnepovt = sum(nepovt) / 3\n",
    "        if arpovt < arnepovt:\n",
    "            cnt += 1\n",
    "\n",
    "print(cnt)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c18b8874",
   "metadata": {},
   "source": [
    "Ответ: 83"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "08fa4279",
   "metadata": {},
   "source": [
    "##### № 27764 Апробация 04.03.26 "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ffb9055e",
   "metadata": {},
   "source": [
    "Откройте файл электронной таблицы, содержащий в каждой строке пять натуральных чисел. Определите количество строк таблицы, для которых выполнены оба условия:\n",
    "- в строке все числа различны;\n",
    "- удвоенная сумма максимального и минимального чисел строки равна сумме оставшихся трёх её чисел.\n",
    "\n",
    "В ответе запишите только число."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "91661a62",
   "metadata": {},
   "outputs": [],
   "source": [
    "cnt = 0\n",
    "for s in open(\"tasks/9a.txt\").readlines():\n",
    "    s = [int(x) for x in s.split()]\n",
    "    print(s)\n",
    "    max_s = max(s)\n",
    "    min_s = min(s)\n",
    "    s_ost = [x for x in s if x != max_s and x != min_s]\n",
    "    if len(set(s)) == len(s) and 2 * (max_s + min_s) == sum(s_ost):\n",
    "        cnt += 1\n",
    "print(cnt)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b640cfcd",
   "metadata": {},
   "source": [
    "Ответ: 5019"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2bf92bd8",
   "metadata": {},
   "source": [
    "##### № 27621 Апробация 04.03.26"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "566ce06c",
   "metadata": {},
   "source": [
    "Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел. Определите наименьший номер строки таблицы, для которой выполнены оба условия:\n",
    "- в строке все числа различны;\n",
    "- разность максимального и минимального чисел строки равна сумме трёх её оставшихся чисел.\n",
    "\n",
    "В ответе запишите только число."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "0e32bbf0",
   "metadata": {},
   "outputs": [],
   "source": [
    "cnt = 0\n",
    "for s in open(\"tasks/9b.txt\").readlines():\n",
    "    cnt += 1\n",
    "    s = [int(x) for x in s.split()]\n",
    "    max_s = max(s)\n",
    "    min_s = min(s)\n",
    "    s_ost = [x for x in s if x not in [max_s, min_s]]\n",
    "    if len(set(s)) == len(s) and max_s - min_s == sum(s_ost):\n",
    "        print(cnt)\n",
    "        break"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8c4d05cb",
   "metadata": {},
   "source": [
    "Ответ: 1321"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2b9e7827",
   "metadata": {},
   "source": [
    "##### № 27287 (Уровень: Базовый)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0d50f14c",
   "metadata": {},
   "source": [
    "В файле электронной таблицы в каждой строке записаны семь целых чисел. Определите наибольшее повторяющееся число в строке таблице с наименьшим номером, для которой выполнены оба условия:\n",
    "- в строке два разных числа повторяются трижды, одно число не повторяется;\n",
    "- неповторяющееся число не больше минимального из повторяющихся чисел строки.\n",
    "\n",
    "В ответе запишите абсолютное значение полученного результата."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "29a0253a",
   "metadata": {},
   "outputs": [],
   "source": [
    "num = 0\n",
    "for s in open(\"tasks/9_27287.txt\").readlines():\n",
    "    s = [int(x) for x in s.split()]\n",
    "    povt = set([x for x in s if s.count(x) == 3])\n",
    "    nepovt = [x for x in s if x not in povt]\n",
    "    if len(povt) == 2 and max(nepovt) <= min(povt):\n",
    "        print(max(povt))\n",
    "        break"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
